# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2f_DSConv2D, [256, True, 1, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2f_DSConv2D, [512, True, 1, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3_DSConv2D, [512, True, 1, 0.25]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3_DSConv2D, [1024, True, 1, 0.25]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024, 0.25]] # 10

# YOLO11n head
head:
#  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ 6, -1 ], 1, LWCA, [ 2 ] ] # cat backbone P4
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f_DSConv2D, [512, True, 1, 0.25]] # 14
  - [-1, 1, DCLSK, [512]]

#  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [4, 1, DSConv2D, [256, 1, 1]] #13
  - [ [ -1, -2 ], 1, LWCA, [ 2 ] ] # cat backbone P3 14
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f_DSConv2D, [256, True, 1, 0.25]] # 19 (P3/8-small)
  - [-1, 1, DCLSK, [256]]

#  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [2, 1, DSConv2D, [128, 1, 1]]
  - [ [ -1, -2 ], 1, LWCA, [ 2 ] ] # cat backbone P2
  - [[-1, 2], 1, Concat, [1]]
  - [ -1, 2, C2f_DSConv2D, [ 128 , True , 1, 0.5] ] # 24 (P2/4-xsmall)
  - [-1, 1, DCLSK, [128]]

  - [ [ 14, 10 ], 1, LWCA, [ 2 ] ] #  P4 19
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 1, DSConv2D, [512]]

  - [ [ 19, -1 ], 1, LWCA, [ 2 ] ] # P3 20
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 1, DSConv2D, [256]]

  - [ [ 24, -1 ], 1, LWCA, [ 2 ] ] # P2 21
  - [[-1, 24], 1, Concat, [1]]
  - [-1, 1, DSConv2D, [128]]

  - [ [ -1 ,-4 ,-7], 1, Detect, [ nc ] ] # Detect(P2, P3, P4 )