# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 2, C3k2CFM_B, [128, False, 2, 's', False]] # 19 (P3)
  - [-1, 2, C3k2CFM_B, [128, False, 4, 's', False]]
  - [-1, 2, C3k2CFM_B, [128, False, 8, 's', False]]


# YOLO11n head
head:
  - [[-1, 4], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2CFM_B, [128, False, 4, 's', False]]

  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2CFM_B, [128, False, 2, 's', False]]

  - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P2
  - [-1, 2, C3k2, [128, False]]

  - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 2, C3k2CFM_B, [ 128, False, 2, 's', False ] ]

  - [ [ -1, 7 ], 1, Concat, [ 1 ] ] # cat backbone P4
  - [ -1, 2, C3k2CFM_B, [ 128, False, 4, 's', False ] ]

  - [ [ -1, 5 ], 1, Concat, [ 1 ] ] # cat backbone P5
  - [ -1, 2, C3k2CFM_B, [ 128, False, 8, 's', False ] ]
  - [ [11, 13, 15, 17], 1, Concat, [ 1 ] ]

  - [[-1], 1, Detect, [nc]] # Detect(P3, P4, P5)


## YOLO11n backbone
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#  - [-1, 2, C3k2, [256, False, 0.25]]
#  - [-1, 2, C3k2CFM_B, [128, False, 2, 's', False]] # 19 (P3)
#  - [-1, 2, C3k2CFM_B, [128, False, 4, 's', False]]
#  - [-1, 2, C3k2CFM_B, [128, False, 8, 's', True]]
#
#
## YOLO11n head
#head:
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P4
#  - [-1, 2, C3k2CFM_B, [128, False, 4, 's', False]]
#
#  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
#  - [-1, 2, C3k2CFM_B, [128, False, 2, 's', False]]
#
#  - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P2
#  - [-1, 2, C3k2, [128, False]]
#
#  - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat backbone P3
#  - [ -1, 2, C3k2CFM_B, [ 128, False, 2, 's', False ] ]
#
#  - [ [ -1, 7 ], 1, Concat, [ 1 ] ] # cat backbone P4
#  - [ -1, 2, C3k2CFM_B, [ 128, False, 4, 's', False ] ]
#
#  - [ [ -1, 5 ], 1, Concat, [ 1 ] ] # cat backbone P5
#  - [ -1, 2, C3k2CFM_B, [ 128, False, 8, 's', True ] ]
#
#  - [[11, 13, 15, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)
